Techniques/questions to look at with this particular exmaple:

+ How to merge datasets and different merge techniques
+ List of movies that are rated most by users
+ In ratings, how to address ratings sparsity problem
+ Plot distributions
+ Identify different age groups and technique of binning
+ Subgrouping and unstacking
+ Differences in ratings by gender

In [8]:
import pandas as pd
import numpy as np

In [9]:
# pass in column names for each CSV
%cd C:\Users\Mahesh Jadhav\Desktop\Python\Session 4
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']
users = pd.read_csv('u.user', sep='|', names=u_cols,
                    encoding='latin-1')

r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv('u.data', sep='\t', names=r_cols,
                      encoding='latin-1')

# the movies file contains columns indicating the movie's genres
# let's only load the first five columns of the file with usecols
m_cols = ['movie_id', 'title', 'release_date', 'video_release_date', 'imdb_url']
movies = pd.read_csv('u.item', sep='|', names=m_cols, usecols=range(5),
                     encoding='latin-1')

C:\Users\Mahesh Jadhav\Desktop\Python\Session 4

In [10]:
users.shape

(943, 5)

In [11]:
users.head(10)

   user_id  age sex     occupation zip_code
0        1   24   M     technician    85711
1        2   53   F          other    94043
2        3   23   M         writer    32067
3        4   24   M     technician    43537
4        5   33   F          other    15213
5        6   42   M      executive    98101
6        7   57   M  administrator    91344
7        8   36   M  administrator    05201
8        9   29   M        student    01002
9       10   53   M         lawyer    90703

In [12]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
user_id       943 non-null int64
age           943 non-null int64
sex           943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(2), object(3)
memory usage: 36.9+ KB

In [13]:
movies.dtypes

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object

In [14]:
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [15]:
movies['movie_id'].head()

0    1
1    2
2    3
3    4
4    5
Name: movie_id, dtype: int64

In [16]:
#Selecting a subset of columns
movies[['movie_id','title']].head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [22]:
#Another example of subsetting
users.age<40
users[users.age>60]#.tail(10)

     user_id  age sex     occupation zip_code
105      106   61   M        retired    55125
210      211   66   M       salesman    32605
265      266   62   F  administrator    78756
317      318   65   M        retired    06518
348      349   68   M        retired    61455
350      351   61   M       educator    49938
363      364   63   M       engineer    01810
422      423   64   M          other    91606
480      481   73   M        retired    37771
519      520   62   M     healthcare    12603
558      559   69   M      executive    10022
563      564   65   M        retired    94591
572      573   68   M        retired    48911
584      585   69   M      librarian    98501
650      651   65   M        retired    02903
766      767   70   M       engineer    00000
776      777   63   M     programmer    01810
802      803   70   M  administrator    78212
844      845   64   M         doctor    97405
857      858   63   M       educator    09645
859      860   70   F        retired    48322
933      934   61   M       engineer    22902

In [27]:
users.head()

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213

In [25]:
users[(users.age < 40) & (users.sex == 'F')].head()

    user_id  age sex occupation zip_code
4         5   33   F      other    15213
10       11   39   F      other    30329
11       12   28   F      other    06405
17       18   35   F      other    37212
22       23   30   F     artist    48197

In [26]:
users.set_index('user_id', inplace=True)
users.head()

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213

In [28]:
users.reset_index(inplace=True)
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [29]:
#Merge datasets
movie_ratings = pd.merge(movies, ratings)
lens = pd.merge(movie_ratings, users)

In [32]:
movie_ratings.head()
lens.head()

,movie_id,title,release_date,video_release_date,imdb_url,user_id,rating,unix_timestamp,age,sex,occupation,zip_code
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,308,4,887736532,60,M,retired,95076
1,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,308,5,887737890,60,M,retired,95076
2,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),308,4,887739608,60,M,retired,95076
3,7,Twelve Monkeys (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Twelve%20Monk...,308,4,887738847,60,M,retired,95076
4,8,Babe (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Babe%20(1995),308,5,887736696,60,M,retired,95076

In [ ]:
#Let us answer some simple questions now. 
#Most rated movies
most_rated = lens.groupby('title').size().sort_values(ascending=False)
most_rated

In [ ]:
lens.title.value_counts()[:20]

In [ ]:
#Highest rated movies
highest_ratings = lens.groupby('title').agg({'rating':[np.size,np.mean]})
highest_ratings.head(10)

In [ ]:
highest_ratings.sort_values([('rating', 'mean')], ascending=False).head()

In [ ]:
atleast_100 = highest_ratings['rating']['size'] >= 200
highest_ratings[atleast_100].sort_values([('rating', 'mean')], ascending=False)[:15]

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
users.age.plot.hist(bins=5)
plt.title("Distribution of users' ages")
plt.ylabel('count of users')
plt.xlabel('age');

In [ ]:
lens['age'][397]

In [ ]:
labels = ['0-9', '10-19', '20-29', '30-39', '40-49', '50-59', '60-69', '70-79']
lens['age_group'] = pd.cut(lens.age, range(0, 81, 10), right=False, labels=labels)

In [ ]:
lens.groupby('age_group').agg({'rating': [np.size, np.mean]})

In [ ]:
most_100 = lens.groupby('movie_id').size().sort_values(ascending=False)[:100]

In [ ]:
lens.set_index('movie_id', inplace=True)

In [ ]:
by_age = lens.loc[most_100.index].groupby(['title', 'age_group'])
by_age.rating.mean().head(15)

In [ ]:
by_age.rating.mean().unstack(1).fillna(0)[10:20]

In [ ]:
lens.reset_index('movie_id', inplace=True)

In [ ]:
pivoted = lens.pivot_table(index=['movie_id', 'title'],
                           columns=['sex'],
                           values='rating',
                           fill_value=0)
pivoted.head()

In [ ]:
pivoted['diff'] = pivoted.M - pivoted.F
pivoted.head()

In [ ]:
pivoted.reset_index('movie_id', inplace=True)

In [ ]:
disagreements = pivoted[pivoted.movie_id.isin(most_100.index)]['diff']
disagreements.sort_values().plot(kind='barh', figsize=[9, 15])
plt.title('Male vs. Female Avg. Ratings\n(Difference > 0 = Favored by Men)')
plt.ylabel('Title')
plt.xlabel('Average Rating Difference');